{"format":"layers-model","generatedBy":"keras v2.2.4","convertedBy":"TensorFlow.js Converter v1.2.10.1","modelTopology":{"keras_version":"2.2.4","backend":"tensorflow","model_config":{"class_name":"Model","config":{"name":"model_2","layers":[{"name":"input_2","class_name":"InputLayer","config":{"batch_input_shape":[null,512,512,3],"dtype":"float32","sparse":false,"name":"input_2"},"inbound_nodes":[]},{"name":"zero_padding2d_4","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_4","trainable":true,"padding":[[3,3],[3,3]],"data_format":"channels_last"},"inbound_nodes":[[["input_2",0,0,{}]]]},{"name":"cp.resnet.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.conv1","trainable":true,"filters":64,"kernel_size":[7,7],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_4",0,0,{}]]]},{"name":"cp.resnet.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.conv1",0,0,{}]]]},{"name":"activation_1","class_name":"Activation","config":{"name":"activation_1","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.bn1",0,0,{}]]]},{"name":"zero_padding2d_5","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_5","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_1",0,0,{}]]]},{"name":"max_pooling2d_6","class_name":"MaxPooling2D","config":{"name":"max_pooling2d_6","trainable":true,"pool_size":[3,3],"padding":"valid","strides":[2,2],"data_format":"channels_last"},"inbound_nodes":[[["zero_padding2d_5",0,0,{}]]]},{"name":"zero_padding2d_6","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_6","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["max_pooling2d_6",0,0,{}]]]},{"name":"cp.resnet.layer1.0.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.layer1.0.conv1","trainable":true,"filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_6",0,0,{}]]]},{"name":"cp.resnet.layer1.0.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer1.0.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer1.0.conv1",0,0,{}]]]},{"name":"activation_2","class_name":"Activation","config":{"name":"activation_2","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.layer1.0.bn1",0,0,{}]]]},{"name":"zero_padding2d_7","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_7","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_2",0,0,{}]]]},{"name":"cp.resnet.layer1.0.conv2","class_name":"Conv2D","config":{"name":"cp.resnet.layer1.0.conv2","trainable":true,"filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_7",0,0,{}]]]},{"name":"cp.resnet.layer1.0.bn2","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer1.0.bn2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer1.0.conv2",0,0,{}]]]},{"name":"add_1","class_name":"Add","config":{"name":"add_1","trainable":true},"inbound_nodes":[[["cp.resnet.layer1.0.bn2",0,0,{}],["max_pooling2d_6",0,0,{}]]]},{"name":"activation_3","class_name":"Activation","config":{"name":"activation_3","trainable":true,"activation":"relu"},"inbound_nodes":[[["add_1",0,0,{}]]]},{"name":"zero_padding2d_8","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_8","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_3",0,0,{}]]]},{"name":"cp.resnet.layer1.1.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.layer1.1.conv1","trainable":true,"filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_8",0,0,{}]]]},{"name":"cp.resnet.layer1.1.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer1.1.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer1.1.conv1",0,0,{}]]]},{"name":"activation_4","class_name":"Activation","config":{"name":"activation_4","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.layer1.1.bn1",0,0,{}]]]},{"name":"zero_padding2d_9","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_9","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_4",0,0,{}]]]},{"name":"cp.resnet.layer1.1.conv2","class_name":"Conv2D","config":{"name":"cp.resnet.layer1.1.conv2","trainable":true,"filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_9",0,0,{}]]]},{"name":"cp.resnet.layer1.1.bn2","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer1.1.bn2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer1.1.conv2",0,0,{}]]]},{"name":"add_2","class_name":"Add","config":{"name":"add_2","trainable":true},"inbound_nodes":[[["cp.resnet.layer1.1.bn2",0,0,{}],["activation_3",0,0,{}]]]},{"name":"activation_5","class_name":"Activation","config":{"name":"activation_5","trainable":true,"activation":"relu"},"inbound_nodes":[[["add_2",0,0,{}]]]},{"name":"zero_padding2d_10","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_10","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_5",0,0,{}]]]},{"name":"cp.resnet.layer2.0.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.layer2.0.conv1","trainable":true,"filters":128,"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_10",0,0,{}]]]},{"name":"cp.resnet.layer2.0.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer2.0.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer2.0.conv1",0,0,{}]]]},{"name":"activation_6","class_name":"Activation","config":{"name":"activation_6","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.layer2.0.bn1",0,0,{}]]]},{"name":"zero_padding2d_11","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_11","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_6",0,0,{}]]]},{"name":"cp.resnet.layer2.0.conv2","class_name":"Conv2D","config":{"name":"cp.resnet.layer2.0.conv2","trainable":true,"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_11",0,0,{}]]]},{"name":"cp.resnet.layer2.0.downsample.0","class_name":"Conv2D","config":{"name":"cp.resnet.layer2.0.downsample.0","trainable":true,"filters":128,"kernel_size":[1,1],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_5",0,0,{}]]]},{"name":"cp.resnet.layer2.0.bn2","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer2.0.bn2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer2.0.conv2",0,0,{}]]]},{"name":"cp.resnet.layer2.0.downsample.1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer2.0.downsample.1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer2.0.downsample.0",0,0,{}]]]},{"name":"add_3","class_name":"Add","config":{"name":"add_3","trainable":true},"inbound_nodes":[[["cp.resnet.layer2.0.bn2",0,0,{}],["cp.resnet.layer2.0.downsample.1",0,0,{}]]]},{"name":"activation_7","class_name":"Activation","config":{"name":"activation_7","trainable":true,"activation":"relu"},"inbound_nodes":[[["add_3",0,0,{}]]]},{"name":"zero_padding2d_12","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_12","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_7",0,0,{}]]]},{"name":"cp.resnet.layer2.1.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.layer2.1.conv1","trainable":true,"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_12",0,0,{}]]]},{"name":"cp.resnet.layer2.1.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer2.1.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer2.1.conv1",0,0,{}]]]},{"name":"activation_8","class_name":"Activation","config":{"name":"activation_8","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.layer2.1.bn1",0,0,{}]]]},{"name":"zero_padding2d_13","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_13","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_8",0,0,{}]]]},{"name":"cp.resnet.layer2.1.conv2","class_name":"Conv2D","config":{"name":"cp.resnet.layer2.1.conv2","trainable":true,"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_13",0,0,{}]]]},{"name":"cp.resnet.layer2.1.bn2","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer2.1.bn2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer2.1.conv2",0,0,{}]]]},{"name":"add_4","class_name":"Add","config":{"name":"add_4","trainable":true},"inbound_nodes":[[["cp.resnet.layer2.1.bn2",0,0,{}],["activation_7",0,0,{}]]]},{"name":"activation_9","class_name":"Activation","config":{"name":"activation_9","trainable":true,"activation":"relu"},"inbound_nodes":[[["add_4",0,0,{}]]]},{"name":"zero_padding2d_14","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_14","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_9",0,0,{}]]]},{"name":"cp.resnet.layer3.0.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.layer3.0.conv1","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_14",0,0,{}]]]},{"name":"cp.resnet.layer3.0.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer3.0.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer3.0.conv1",0,0,{}]]]},{"name":"activation_10","class_name":"Activation","config":{"name":"activation_10","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.layer3.0.bn1",0,0,{}]]]},{"name":"zero_padding2d_15","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_15","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_10",0,0,{}]]]},{"name":"cp.resnet.layer3.0.conv2","class_name":"Conv2D","config":{"name":"cp.resnet.layer3.0.conv2","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_15",0,0,{}]]]},{"name":"cp.resnet.layer3.0.downsample.0","class_name":"Conv2D","config":{"name":"cp.resnet.layer3.0.downsample.0","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_9",0,0,{}]]]},{"name":"cp.resnet.layer3.0.bn2","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer3.0.bn2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer3.0.conv2",0,0,{}]]]},{"name":"cp.resnet.layer3.0.downsample.1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer3.0.downsample.1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer3.0.downsample.0",0,0,{}]]]},{"name":"add_5","class_name":"Add","config":{"name":"add_5","trainable":true},"inbound_nodes":[[["cp.resnet.layer3.0.bn2",0,0,{}],["cp.resnet.layer3.0.downsample.1",0,0,{}]]]},{"name":"activation_11","class_name":"Activation","config":{"name":"activation_11","trainable":true,"activation":"relu"},"inbound_nodes":[[["add_5",0,0,{}]]]},{"name":"zero_padding2d_16","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_16","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_11",0,0,{}]]]},{"name":"cp.resnet.layer3.1.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.layer3.1.conv1","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_16",0,0,{}]]]},{"name":"cp.resnet.layer3.1.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer3.1.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer3.1.conv1",0,0,{}]]]},{"name":"activation_12","class_name":"Activation","config":{"name":"activation_12","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.layer3.1.bn1",0,0,{}]]]},{"name":"zero_padding2d_17","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_17","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_12",0,0,{}]]]},{"name":"cp.resnet.layer3.1.conv2","class_name":"Conv2D","config":{"name":"cp.resnet.layer3.1.conv2","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_17",0,0,{}]]]},{"name":"cp.resnet.layer3.1.bn2","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer3.1.bn2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer3.1.conv2",0,0,{}]]]},{"name":"add_6","class_name":"Add","config":{"name":"add_6","trainable":true},"inbound_nodes":[[["cp.resnet.layer3.1.bn2",0,0,{}],["activation_11",0,0,{}]]]},{"name":"activation_13","class_name":"Activation","config":{"name":"activation_13","trainable":true,"activation":"relu"},"inbound_nodes":[[["add_6",0,0,{}]]]},{"name":"zero_padding2d_18","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_18","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_13",0,0,{}]]]},{"name":"cp.resnet.layer4.0.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.layer4.0.conv1","trainable":true,"filters":512,"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_18",0,0,{}]]]},{"name":"cp.resnet.layer4.0.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer4.0.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer4.0.conv1",0,0,{}]]]},{"name":"activation_16","class_name":"Activation","config":{"name":"activation_16","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.layer4.0.bn1",0,0,{}]]]},{"name":"zero_padding2d_19","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_19","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_16",0,0,{}]]]},{"name":"cp.resnet.layer4.0.conv2","class_name":"Conv2D","config":{"name":"cp.resnet.layer4.0.conv2","trainable":true,"filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_19",0,0,{}]]]},{"name":"cp.resnet.layer4.0.downsample.0","class_name":"Conv2D","config":{"name":"cp.resnet.layer4.0.downsample.0","trainable":true,"filters":512,"kernel_size":[1,1],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_13",0,0,{}]]]},{"name":"cp.resnet.layer4.0.bn2","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer4.0.bn2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer4.0.conv2",0,0,{}]]]},{"name":"cp.resnet.layer4.0.downsample.1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer4.0.downsample.1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer4.0.downsample.0",0,0,{}]]]},{"name":"add_7","class_name":"Add","config":{"name":"add_7","trainable":true},"inbound_nodes":[[["cp.resnet.layer4.0.bn2",0,0,{}],["cp.resnet.layer4.0.downsample.1",0,0,{}]]]},{"name":"activation_17","class_name":"Activation","config":{"name":"activation_17","trainable":true,"activation":"relu"},"inbound_nodes":[[["add_7",0,0,{}]]]},{"name":"zero_padding2d_20","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_20","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_17",0,0,{}]]]},{"name":"cp.resnet.layer4.1.conv1","class_name":"Conv2D","config":{"name":"cp.resnet.layer4.1.conv1","trainable":true,"filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_20",0,0,{}]]]},{"name":"cp.resnet.layer4.1.bn1","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer4.1.bn1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer4.1.conv1",0,0,{}]]]},{"name":"activation_18","class_name":"Activation","config":{"name":"activation_18","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.resnet.layer4.1.bn1",0,0,{}]]]},{"name":"zero_padding2d_21","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_21","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["activation_18",0,0,{}]]]},{"name":"cp.resnet.layer4.1.conv2","class_name":"Conv2D","config":{"name":"cp.resnet.layer4.1.conv2","trainable":true,"filters":512,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_21",0,0,{}]]]},{"name":"cp.resnet.layer4.1.bn2","class_name":"BatchNormalization","config":{"name":"cp.resnet.layer4.1.bn2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.resnet.layer4.1.conv2",0,0,{}]]]},{"name":"add_8","class_name":"Add","config":{"name":"add_8","trainable":true},"inbound_nodes":[[["cp.resnet.layer4.1.bn2",0,0,{}],["activation_17",0,0,{}]]]},{"name":"activation_19","class_name":"Activation","config":{"name":"activation_19","trainable":true,"activation":"relu"},"inbound_nodes":[[["add_8",0,0,{}]]]},{"name":"cp.arm32.conv.conv","class_name":"Conv2D","config":{"name":"cp.arm32.conv.conv","trainable":true,"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_19",0,0,{}]]]},{"name":"cp.arm32.conv.bn","class_name":"BatchNormalization","config":{"name":"cp.arm32.conv.bn","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.arm32.conv.conv",0,0,{}]]]},{"name":"activation_21","class_name":"Activation","config":{"name":"activation_21","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.arm32.conv.bn",0,0,{}]]]},{"name":"global_average_pooling2d_3","class_name":"GlobalAveragePooling2D","config":{"name":"global_average_pooling2d_3","trainable":true,"data_format":"channels_last"},"inbound_nodes":[[["activation_21",0,0,{}]]]},{"name":"global_average_pooling2d_2","class_name":"GlobalAveragePooling2D","config":{"name":"global_average_pooling2d_2","trainable":true,"data_format":"channels_last"},"inbound_nodes":[[["activation_19",0,0,{}]]]},{"name":"reshape_3","class_name":"Reshape","config":{"name":"reshape_3","trainable":true,"target_shape":[1,1,128]},"inbound_nodes":[[["global_average_pooling2d_3",0,0,{}]]]},{"name":"reshape_2","class_name":"Reshape","config":{"name":"reshape_2","trainable":true,"target_shape":[1,1,512]},"inbound_nodes":[[["global_average_pooling2d_2",0,0,{}]]]},{"name":"cp.arm32.conv_atten","class_name":"Conv2D","config":{"name":"cp.arm32.conv_atten","trainable":true,"filters":128,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["reshape_3",0,0,{}]]]},{"name":"cp.conv_avg.conv","class_name":"Conv2D","config":{"name":"cp.conv_avg.conv","trainable":true,"filters":128,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["reshape_2",0,0,{}]]]},{"name":"cp.arm16.conv.conv","class_name":"Conv2D","config":{"name":"cp.arm16.conv.conv","trainable":true,"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_13",0,0,{}]]]},{"name":"cp.arm32.bn_atten","class_name":"BatchNormalization","config":{"name":"cp.arm32.bn_atten","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.arm32.conv_atten",0,0,{}]]]},{"name":"cp.conv_avg.bn","class_name":"BatchNormalization","config":{"name":"cp.conv_avg.bn","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.conv_avg.conv",0,0,{}]]]},{"name":"cp.arm16.conv.bn","class_name":"BatchNormalization","config":{"name":"cp.arm16.conv.bn","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.arm16.conv.conv",0,0,{}]]]},{"name":"activation_22","class_name":"Activation","config":{"name":"activation_22","trainable":true,"activation":"sigmoid"},"inbound_nodes":[[["cp.arm32.bn_atten",0,0,{}]]]},{"name":"activation_20","class_name":"Activation","config":{"name":"activation_20","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.conv_avg.bn",0,0,{}]]]},{"name":"activation_14","class_name":"Activation","config":{"name":"activation_14","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.arm16.conv.bn",0,0,{}]]]},{"name":"multiply_2","class_name":"Multiply","config":{"name":"multiply_2","trainable":true},"inbound_nodes":[[["activation_21",0,0,{}],["activation_22",0,0,{}]]]},{"name":"bisenetresize_3","class_name":"BiSeNetResize","config":{"name":"bisenetresize_3","trainable":true,"size":[16,16],"output_shape":null,"output_shape_type":"raw","arguments":{}},"inbound_nodes":[[["activation_20",0,0,{}]]]},{"name":"global_average_pooling2d_1","class_name":"GlobalAveragePooling2D","config":{"name":"global_average_pooling2d_1","trainable":true,"data_format":"channels_last"},"inbound_nodes":[[["activation_14",0,0,{}]]]},{"name":"feat32_sum","class_name":"Add","config":{"name":"feat32_sum","trainable":true},"inbound_nodes":[[["multiply_2",0,0,{}],["bisenetresize_3",0,0,{}]]]},{"name":"reshape_1","class_name":"Reshape","config":{"name":"reshape_1","trainable":true,"target_shape":[1,1,128]},"inbound_nodes":[[["global_average_pooling2d_1",0,0,{}]]]},{"name":"bisenetresize_4","class_name":"BiSeNetResize","config":{"name":"bisenetresize_4","trainable":true,"size":[32,32],"output_shape":null,"output_shape_type":"raw","arguments":{}},"inbound_nodes":[[["feat32_sum",0,0,{}]]]},{"name":"cp.arm16.conv_atten","class_name":"Conv2D","config":{"name":"cp.arm16.conv_atten","trainable":true,"filters":128,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["reshape_1",0,0,{}]]]},{"name":"zero_padding2d_22","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_22","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["bisenetresize_4",0,0,{}]]]},{"name":"cp.arm16.bn_atten","class_name":"BatchNormalization","config":{"name":"cp.arm16.bn_atten","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.arm16.conv_atten",0,0,{}]]]},{"name":"cp.conv_head32.conv","class_name":"Conv2D","config":{"name":"cp.conv_head32.conv","trainable":true,"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_22",0,0,{}]]]},{"name":"activation_15","class_name":"Activation","config":{"name":"activation_15","trainable":true,"activation":"sigmoid"},"inbound_nodes":[[["cp.arm16.bn_atten",0,0,{}]]]},{"name":"cp.conv_head32.bn","class_name":"BatchNormalization","config":{"name":"cp.conv_head32.bn","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.conv_head32.conv",0,0,{}]]]},{"name":"multiply_1","class_name":"Multiply","config":{"name":"multiply_1","trainable":true},"inbound_nodes":[[["activation_14",0,0,{}],["activation_15",0,0,{}]]]},{"name":"activation_23","class_name":"Activation","config":{"name":"activation_23","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.conv_head32.bn",0,0,{}]]]},{"name":"feat16_sum","class_name":"Add","config":{"name":"feat16_sum","trainable":true},"inbound_nodes":[[["multiply_1",0,0,{}],["activation_23",0,0,{}]]]},{"name":"bisenetresize_5","class_name":"BiSeNetResize","config":{"name":"bisenetresize_5","trainable":true,"size":[64,64],"output_shape":null,"output_shape_type":"raw","arguments":{}},"inbound_nodes":[[["feat16_sum",0,0,{}]]]},{"name":"zero_padding2d_23","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_23","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["bisenetresize_5",0,0,{}]]]},{"name":"cp.conv_head16.conv","class_name":"Conv2D","config":{"name":"cp.conv_head16.conv","trainable":true,"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_23",0,0,{}]]]},{"name":"cp.conv_head16.bn","class_name":"BatchNormalization","config":{"name":"cp.conv_head16.bn","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["cp.conv_head16.conv",0,0,{}]]]},{"name":"activation_24","class_name":"Activation","config":{"name":"activation_24","trainable":true,"activation":"relu"},"inbound_nodes":[[["cp.conv_head16.bn",0,0,{}]]]},{"name":"concatenate_2","class_name":"Concatenate","config":{"name":"concatenate_2","trainable":true,"axis":-1},"inbound_nodes":[[["activation_9",0,0,{}],["activation_24",0,0,{}]]]},{"name":"ffm.convblk.conv","class_name":"Conv2D","config":{"name":"ffm.convblk.conv","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["concatenate_2",0,0,{}]]]},{"name":"ffm.convblk.bn","class_name":"BatchNormalization","config":{"name":"ffm.convblk.bn","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["ffm.convblk.conv",0,0,{}]]]},{"name":"activation_25","class_name":"Activation","config":{"name":"activation_25","trainable":true,"activation":"relu"},"inbound_nodes":[[["ffm.convblk.bn",0,0,{}]]]},{"name":"global_average_pooling2d_4","class_name":"GlobalAveragePooling2D","config":{"name":"global_average_pooling2d_4","trainable":true,"data_format":"channels_last"},"inbound_nodes":[[["activation_25",0,0,{}]]]},{"name":"reshape_4","class_name":"Reshape","config":{"name":"reshape_4","trainable":true,"target_shape":[1,1,256]},"inbound_nodes":[[["global_average_pooling2d_4",0,0,{}]]]},{"name":"ffm.conv1","class_name":"Conv2D","config":{"name":"ffm.conv1","trainable":true,"filters":64,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["reshape_4",0,0,{}]]]},{"name":"activation_26","class_name":"Activation","config":{"name":"activation_26","trainable":true,"activation":"relu"},"inbound_nodes":[[["ffm.conv1",0,0,{}]]]},{"name":"ffm.conv2","class_name":"Conv2D","config":{"name":"ffm.conv2","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_26",0,0,{}]]]},{"name":"activation_27","class_name":"Activation","config":{"name":"activation_27","trainable":true,"activation":"sigmoid"},"inbound_nodes":[[["ffm.conv2",0,0,{}]]]},{"name":"multiply_3","class_name":"Multiply","config":{"name":"multiply_3","trainable":true},"inbound_nodes":[[["activation_25",0,0,{}],["activation_27",0,0,{}]]]},{"name":"add_9","class_name":"Add","config":{"name":"add_9","trainable":true},"inbound_nodes":[[["activation_25",0,0,{}],["multiply_3",0,0,{}]]]},{"name":"zero_padding2d_24","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_24","trainable":true,"padding":[[1,1],[1,1]],"data_format":"channels_last"},"inbound_nodes":[[["add_9",0,0,{}]]]},{"name":"conv_out.conv.conv","class_name":"Conv2D","config":{"name":"conv_out.conv.conv","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,