{"format": "layers-model", "generatedBy": "keras v2.1.2", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.1.2", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 3, 256, 256], "name": "input_1", "dtype": "float32"}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": [[3, 3], [3, 3]], "data_format": "channels_first", "name": "zero_padding2d_1", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [7, 7], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [2, 2], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_1", "use_bias": true, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_1", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["torch_batch_norm2d_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_2", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["torch_batch_norm2d_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_2", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_2", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_3", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["torch_batch_norm2d_3", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_3", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_3", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_4", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["torch_batch_norm2d_4", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_4", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_4", "trainable": true}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_5", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_5", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_4", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["torch_batch_norm2d_5", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["conv2d_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": 1}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_5", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"data_format": "channels_first", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "average_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_6", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_6", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["torch_batch_norm2d_6", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_5", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_5", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_6", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_7", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_7", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["torch_batch_norm2d_7", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_6", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_6", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_7", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_8", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["torch_batch_norm2d_8", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_7", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_7", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_8", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["conv2d_7", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "config": {"name": "concatenate_2", "trainable": true, "axis": 1}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_9", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_9", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["torch_batch_norm2d_9", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_8", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_8", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_9", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_10", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_10", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["torch_batch_norm2d_10", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_9", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_9", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_10", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_11", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_11", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["torch_batch_norm2d_11", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_10", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_10", "trainable": true}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_12", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_12", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_11", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["torch_batch_norm2d_12", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["conv2d_10", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "config": {"name": "concatenate_3", "trainable": true, "axis": 1}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "filters": 256, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_12", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["concatenate_3", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"data_format": "channels_first", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "average_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_16", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_16", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["torch_batch_norm2d_16", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_16", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_14", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_14", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_16", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_17", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_17", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["torch_batch_norm2d_17", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_17", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_15", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_15", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_17", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_18", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_18", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["torch_batch_norm2d_18", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_18", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_16", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_16", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_18", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_5", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["conv2d_17", 0, 0, {}], ["conv2d_18", 0, 0, {}]]], "config": {"name": "concatenate_5", "trainable": true, "axis": 1}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["concatenate_5", 0, 0, {}], ["average_pooling2d_2", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"data_format": "channels_first", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "average_pooling2d_3", "pool_size": [2, 2]}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_22", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_22", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["torch_batch_norm2d_22", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_22", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_20", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_20", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_22", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_23", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_23", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["torch_batch_norm2d_23", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_23", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_21", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_21", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["zero_padding2d_21", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_23", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_24", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_24", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["torch_batch_norm2d_24", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_24", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_22", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_22", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["zero_padding2d_22", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_24", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_7", "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["conv2d_23", 0, 0, {}], ["conv2d_24", 0, 0, {}]]], "config": {"name": "concatenate_7", "trainable": true, "axis": 1}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["concatenate_7", 0, 0, {}], ["average_pooling2d_3", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_4", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"data_format": "channels_first", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "average_pooling2d_4", "pool_size": [2, 2]}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_28", "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_28", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_28", "inbound_nodes": [[["torch_batch_norm2d_28", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_28", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_26", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_26", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_28", "inbound_nodes": [[["zero_padding2d_26", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_28", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_29", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_29", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_29", "inbound_nodes": [[["torch_batch_norm2d_29", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_29", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_27", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_27", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_29", "inbound_nodes": [[["zero_padding2d_27", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_29", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_30", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_30", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_30", "inbound_nodes": [[["torch_batch_norm2d_30", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_30", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_28", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_28", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_30", "inbound_nodes": [[["zero_padding2d_28", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_30", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_9", "inbound_nodes": [[["conv2d_28", 0, 0, {}], ["conv2d_29", 0, 0, {}], ["conv2d_30", 0, 0, {}]]], "config": {"name": "concatenate_9", "trainable": true, "axis": 1}}, {"class_name": "Add", "name": "add_9", "inbound_nodes": [[["concatenate_9", 0, 0, {}], ["average_pooling2d_4", 0, 0, {}]]], "config": {"name": "add_9", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_5", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"data_format": "channels_first", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "average_pooling2d_5", "pool_size": [2, 2]}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_34", "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_34", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_34", "inbound_nodes": [[["torch_batch_norm2d_34", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_34", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_32", "inbound_nodes": [[["activation_34", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_34", "inbound_nodes": [[["zero_padding2d_32", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_34", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_35", "inbound_nodes": [[["conv2d_34", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_35", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_35", "inbound_nodes": [[["torch_batch_norm2d_35", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_35", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_33", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_33", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_35", "inbound_nodes": [[["zero_padding2d_33", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_35", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_36", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_36", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_36", "inbound_nodes": [[["torch_batch_norm2d_36", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_36", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_34", "inbound_nodes": [[["activation_36", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_34", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_36", "inbound_nodes": [[["zero_padding2d_34", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_36", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_11", "inbound_nodes": [[["conv2d_34", 0, 0, {}], ["conv2d_35", 0, 0, {}], ["conv2d_36", 0, 0, {}]]], "config": {"name": "concatenate_11", "trainable": true, "axis": 1}}, {"class_name": "Add", "name": "add_11", "inbound_nodes": [[["concatenate_11", 0, 0, {}], ["average_pooling2d_5", 0, 0, {}]]], "config": {"name": "add_11", "trainable": true}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_37", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_37", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_37", "inbound_nodes": [[["torch_batch_norm2d_37", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_37", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_35", "inbound_nodes": [[["activation_37", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_35", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_37", "inbound_nodes": [[["zero_padding2d_35", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_37", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_38", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_38", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_38", "inbound_nodes": [[["torch_batch_norm2d_38", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_38", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_36", "inbound_nodes": [[["activation_38", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_36", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_38", "inbound_nodes": [[["zero_padding2d_36", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_38", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_39", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_39", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_39", "inbound_nodes": [[["torch_batch_norm2d_39", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_39", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_37", "inbound_nodes": [[["activation_39", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_37", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_39", "inbound_nodes": [[["zero_padding2d_37", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_39", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_12", "inbound_nodes": [[["conv2d_37", 0, 0, {}], ["conv2d_38", 0, 0, {}], ["conv2d_39", 0, 0, {}]]], "config": {"name": "concatenate_12", "trainable": true, "axis": 1}}, {"class_name": "Add", "name": "add_12", "inbound_nodes": [[["concatenate_12", 0, 0, {}], ["add_11", 0, 0, {}]]], "config": {"name": "add_12", "trainable": true}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_40", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_40", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_31", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_31", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_40", "inbound_nodes": [[["torch_batch_norm2d_40", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_40", "trainable": true}}, {"class_name": "Activation", "name": "activation_31", "inbound_nodes": [[["torch_batch_norm2d_31", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_31", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_38", "inbound_nodes": [[["activation_40", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_38", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_29", "inbound_nodes": [[["activation_31", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_29", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_40", "inbound_nodes": [[["zero_padding2d_38", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_40", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_31", "inbound_nodes": [[["zero_padding2d_29", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_31", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_41", "inbound_nodes": [[["conv2d_40", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_41", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_32", "inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_32", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_41", "inbound_nodes": [[["torch_batch_norm2d_41", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_41", "trainable": true}}, {"class_name": "Activation", "name": "activation_32", "inbound_nodes": [[["torch_batch_norm2d_32", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_32", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_39", "inbound_nodes": [[["activation_41", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_39", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_30", "inbound_nodes": [[["activation_32", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_30", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_41", "inbound_nodes": [[["zero_padding2d_39", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_41", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_32", "inbound_nodes": [[["zero_padding2d_30", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_32", "use_bias": false, "bias_regularizer": null}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_42", "inbound_nodes": [[["conv2d_41", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_42", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_33", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_33", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_42", "inbound_nodes": [[["torch_batch_norm2d_42", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_42", "trainable": true}}, {"class_name": "Activation", "name": "activation_33", "inbound_nodes": [[["torch_batch_norm2d_33", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_33", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_40", "inbound_nodes": [[["activation_42", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_40", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_31", "inbound_nodes": [[["activation_33", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": "channels_first", "name": "zero_padding2d_31", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_42", "inbound_nodes": [[["zero_padding2d_40", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_42", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_33", "inbound_nodes": [[["zero_padding2d_31", 0, 0, {}]]], "config": {"data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_33", "use_bias": false, "bias_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_13", "inbound_nodes": [[["conv2d_40", 0, 0, {}], ["conv2d_41", 0, 0, {}], ["conv2d_42", 0, 0, {}]]], "config": {"name": "concatenate_13", "trainable": true, "axis": 1}}, {"class_name": "Concatenate", "name": "concatenate_10", "inbound_nodes": [[["conv2d_31", 0, 0, {}], ["conv2d_32", 0, 0, {}], ["conv2d_33", 0, 0, {}]]], "config": {"name": "concatenate_10", "trainable": true, "axis": 1}}, {"class_name": "Add", "name": "add_13", "inbound_nodes": [[["concatenate_13", 0, 0, {}], ["add_12", 0, 0, {}]]], "config": {"name": "add_13", "trainable": true}}, {"class_name": "Add", "name": "add_10", "inbound_nodes": [[["concatenate_10", 0, 0, {}], ["add_9", 0, 0, {}]]], "config": {"name": "add_10", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["add_13", 0, 0, {}]]], "config": {"data_format": "channels_first", "name": "up_sampling2d_1", "size": [2, 2], "trainable": true}}, {"class_name": "Add", "name": "add_14", "inbound_nodes": [[["add_10", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "config": {"name": "add_14", "trainable": true}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_43", "inbound_nodes": [[["add_14", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_43", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "TorchBatchNorm2D", "name": "torch_batch_norm2d_25", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"epsilon": 1e-05, "name": "torch_batch_norm2d_25", "momentum": 0.1, "trainable": true, "axis": 1}}, {"class_name": "Activation", "name": "activation_43", "inbound_nodes": [[["torch_batch_norm2d_43", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_43", "trainable": true}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["torch_batch_norm2d_25", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_25", "trainable": true}}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_41", "inbound_nodes": [[["activation_43", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "data_format": 